ReSerendipity/health-info-card/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 3 MB 应用上限与固定保护分区保持一致。分区表保留
# cardid@0x356000，二创不得移动或覆盖。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 头文件以 "lvgl.h" 简单方式包含(与项目内其他代码一致,自定义字体文件同此)
CONFIG_LV_LVGL_H_INCLUDE_SIMPLE=y
# LVGL 内存用系统堆(C 库 malloc),不用内置静态池。官方截图协议提交
# (6acfd9d)结论:内置 24KB 池在页面对象多时耗尽 -> lv_obj_create 返回
# NULL -> 空指针崩溃(白屏)。本固件含菜单+健康卡,且快照缓冲需要
# 76,800 字节(ARGB2222 整屏),远超任何内置池,必须走系统堆。
CONFIG_LV_USE_CLIB_MALLOC=y
# 串口截屏协议(FAP_SCREENSHOT_V1)依赖快照辅助函数;缓冲在截图时刻
# 动态分配,失败仅记日志不应答。见 docs/reference/y2lin/serial-screenshot-protocol.zh_CN.md。
CONFIG_LV_USE_SNAPSHOT=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# main 任务栈默认 3.5KB 不够:app_main 里 BSP 初始化 + 页面构建 + 日志格式化
# 曾触发 Stack protection fault(表现为设备反复重启/闪屏)。8KB 留足余量。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# esp_timer 任务承担按键回调,放宽到 8KB 消除 LVGL 操作爆栈风险(官方值)。
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
